# Intro to Pandas - Data Analysis Warm Up Exercise

In [1]:
# Imports
import pandas as pd

In [2]:
dict1 = {'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }

df1 = pd.DataFrame(dict1)

df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 1. Display Top 3 Rows of The Dataset

In [4]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

## 2. Check Last 3 Rows of The Dataset

In [5]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 3. Find Shape of Our Dataset (Number of Rows & Number of Columns)

In [6]:
df1.shape

(7, 3)

In [7]:
print('Number of Rows', df1.shape[0])
print('Number of Columns', df1.shape[1])

Number of Rows 7
Number of Columns 3

## 4. Get Information About Our Dataset Like Total Number of Rows, Colums, Datatypes of Each Column And Memory Requirement

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

## 5. Check Null Values In The Dataset

In [13]:
# Booleans overview in each record
df1.isnull()

# Get total value of nulls in each column
# df1.isnull.sum()

# Get total value of nulls by column
# df1.isnull.sum(axis=0)

# Get total value of nulls by rows
# df1.isnull.sum(axis=1)

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

## 6. Get Overall Statistics About The Dataframe

In [16]:
df1.describe(include="all")

# Use this argument to show only non-null values (same as standard .describe() method)
# df1.describe(exclude="O")

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

## 7. Find Unique Values From The Gender Column

In [18]:
df1["Gender"].unique()

array(['Male', 'Female'], dtype=object)

## 8. Find the Number of Unique Values From The Gender Column

In [19]:
df1["Gender"].nunique()

2

## 9. Display Count of Unique Values In Gender Column

In [20]:
df1["Gender"].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

## 10. Find Total Numbers of Students Having Marks Between 90 To 100 (Inclusive) Using Between Method

In [21]:
# Only show booleans
df1["Marks"] >= 90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [22]:
# Show the values that meet the condition / subsetting
df1[df1["Marks"] >= 90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [23]:
# Multiple conditions
(df1["Marks"] >= 90) & (df1["Marks"] <= 100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [25]:
# Subsetting
df1[(df1["Marks"] >= 90) & (df1["Marks"] <= 100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [34]:
# Finding the length of the dataframe
print("length:", len(df1[(df1["Marks"] >= 90) & (df1["Marks"] <= 100)]))

# similar to

print("length:", sum(df1["Marks"].between(90, 100)))

length: 4
length: 4

In [27]:
# Multiple conditions using .between(,) method
df1["Marks"].between(90, 100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [28]:
# Subsetting by multiple conditions using .between(,) method
df1[df1["Marks"].between(90, 100)]

# notice this is similar to:
# df1[(df1["Marks"] >= 90) & (df1["Marks"] <= 100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

## 11. Find Average Marks

In [36]:
df1["Marks"].min()
df1["Marks"].max()
df1["Marks"].mean()

92.14285714285714

## 12. Apply method

### 12.1. Using custom full function

In [37]:
# Using custom full function
def marks(x):
    return x/2

In [44]:
# Applying the function to a column in the dataset
# And pass the output values to a new column
df1["Half_marks"] = df1["Marks"].apply(marks)

# Pass the values as integers instead of float using list comprehension
df1["Half_marks_ints"] = [int(i) for i in df1["Marks"].apply(marks)]

In [45]:
df1

      Name  Marks  Gender  Half_marks  Half_marks_ints
0  Priyang     98    Male        49.0               49
1   Aadhya     89  Female        44.5               44
2   Krisha     99  Female        49.5               49
3   Vedant     87    Male        43.5               43
4   Parshv     90    Male        45.0               45
5   Mittal     83  Female        41.5               41
6  Archana     99  Female        49.5               49

### 12.2. Using lambda function

In [49]:
# Using lambda function
df1["Marks"].apply(lambda x: x / 2)

# The values can be assigned to a new column as well. For example:
df1["Marks_lambda"] = df1["Marks"].apply(lambda x: x // 2)

In [50]:
df1

      Name  Marks  Gender  Half_marks  Half_marks_ints  Marks_lambda
0  Priyang     98    Male        49.0               49            49
1   Aadhya     89  Female        44.5               44            44
2   Krisha     99  Female        49.5               49            49
3   Vedant     87    Male        43.5               43            43
4   Parshv     90    Male        45.0               45            45
5   Mittal     83  Female        41.5               41            41
6  Archana     99  Female        49.5               49            49

### 12.3. Finding length of strings in a column

In [51]:
df1["Name"].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

## 13. Map Function

For example we have following dataframe. Now, say we want to convert categorical values in this case are strings.
For example we want to convert the values in gender column to binary. 0 For Female, and 1 for male.
Now take a look of the original dataset

In [52]:
df1

      Name  Marks  Gender  Half_marks  Half_marks_ints  Marks_lambda
0  Priyang     98    Male        49.0               49            49
1   Aadhya     89  Female        44.5               44            44
2   Krisha     99  Female        49.5               49            49
3   Vedant     87    Male        43.5               43            43
4   Parshv     90    Male        45.0               45            45
5   Mittal     83  Female        41.5               41            41
6  Archana     99  Female        49.5               49            49

And now convert the gender values to binary using map function and assign them to a new column

In [53]:
# Converting categorical values to binary:
# And store the values into a new column
df1["Gender_binary"] = df1["Gender"].map({"Male": 1, "Female": 0})

The new dataset would be:

In [55]:
df1

,Name,Marks,Gender,Half_marks,Half_marks_ints,Marks_lambda,Gender_binary
0,Priyang,98,Male,49.0,49,49,1
1,Aadhya,89,Female,44.5,44,44,0
2,Krisha,99,Female,49.5,49,49,0
3,Vedant,87,Male,43.5,43,43,1
4,Parshv,90,Male,45.0,45,45,1
5,Mittal,83,Female,41.5,41,41,0
6,Archana,99,Female,49.5,49,49,0

This kind of process is also commonly known as <b>encoding</b>

## 14. Dropping/deleting columns

### 14.1. Dropping a column

In [57]:
# Display our dataset
df1

,Name,Marks,Gender,Half_marks,Half_marks_ints,Marks_lambda,Gender_binary
0,Priyang,98,Male,49.0,49,49,1
1,Aadhya,89,Female,44.5,44,44,0
2,Krisha,99,Female,49.5,49,49,0
3,Vedant,87,Male,43.5,43,43,1
4,Parshv,90,Male,45.0,45,45,1
5,Mittal,83,Female,41.5,41,41,0
6,Archana,99,Female,49.5,49,49,0

Dropping a column using axis argument
use axis=1 to drop a column
use axis=0 to drop a row

In [58]:
# Dropping a column using axis argument
# axis 1 = column
# axis 0 = row
df1.drop("Gender_binary", axis=1)

      Name  Marks  Gender  Half_marks  Half_marks_ints  Marks_lambda
0  Priyang     98    Male        49.0               49            49
1   Aadhya     89  Female        44.5               44            44
2   Krisha     99  Female        49.5               49            49
3   Vedant     87    Male        43.5               43            43
4   Parshv     90    Male        45.0               45            45
5   Mittal     83  Female        41.5               41            41
6  Archana     99  Female        49.5               49            49

### 14.2. Dropping multiple columns

In [61]:
df1.drop(['Marks_lambda', 'Gender_binary'], axis=1)

# To save the new processed dataframe to existing dataframe, just simply put inplace=True argument
# df1.drop(['Marks_lambda', 'Gender_binary'], axis=1, inplace=True)

      Name  Marks  Gender  Half_marks  Half_marks_ints
0  Priyang     98    Male        49.0               49
1   Aadhya     89  Female        44.5               44
2   Krisha     99  Female        49.5               49
3   Vedant     87    Male        43.5               43
4   Parshv     90    Male        45.0               45
5   Mittal     83  Female        41.5               41
6  Archana     99  Female        49.5               49

## 15. Printing column names

In [62]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half_marks', 'Half_marks_ints',
       'Marks_lambda', 'Gender_binary'],
      dtype='object')

In [63]:
df1.index

RangeIndex(start=0, stop=7, step=1)

## 16. Sort the Dataframe As Per The Marks Column

In [64]:
df1

,Name,Marks,Gender,Half_marks,Half_marks_ints,Marks_lambda,Gender_binary
0,Priyang,98,Male,49.0,49,49,1
1,Aadhya,89,Female,44.5,44,44,0
2,Krisha,99,Female,49.5,49,49,0
3,Vedant,87,Male,43.5,43,43,1
4,Parshv,90,Male,45.0,45,45,1
5,Mittal,83,Female,41.5,41,41,0
6,Archana,99,Female,49.5,49,49,0

In [65]:
df1.sort_values(by="Marks", ascending=False)

,Name,Marks,Gender,Half_marks,Half_marks_ints,Marks_lambda,Gender_binary
2,Krisha,99,Female,49.5,49,49,0
6,Archana,99,Female,49.5,49,49,0
0,Priyang,98,Male,49.0,49,49,1
4,Parshv,90,Male,45.0,45,45,1
1,Aadhya,89,Female,44.5,44,44,0
3,Vedant,87,Male,43.5,43,43,1
5,Mittal,83,Female,41.5,41,41,0

In [66]:
# Sorting by multiple columns
df1.sort_values(by=['Marks', 'Gender'], ascending=False)

,Name,Marks,Gender,Half_marks,Half_marks_ints,Marks_lambda,Gender_binary
2,Krisha,99,Female,49.5,49,49,0
6,Archana,99,Female,49.5,49,49,0
0,Priyang,98,Male,49.0,49,49,1
4,Parshv,90,Male,45.0,45,45,1
1,Aadhya,89,Female,44.5,44,44,0
3,Vedant,87,Male,43.5,43,43,1
5,Mittal,83,Female,41.5,41,41,0

## 17. Display Name & Marks of The Female Students

In [67]:
# Show the dataframe
df1

,Name,Marks,Gender,Half_marks,Half_marks_ints,Marks_lambda,Gender_binary
0,Priyang,98,Male,49.0,49,49,1
1,Aadhya,89,Female,44.5,44,44,0
2,Krisha,99,Female,49.5,49,49,0
3,Vedant,87,Male,43.5,43,43,1
4,Parshv,90,Male,45.0,45,45,1
5,Mittal,83,Female,41.5,41,41,0
6,Archana,99,Female,49.5,49,49,0

In [71]:
df1[df1['Gender'] == 'Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [72]:
# Equivalent method using isin() method
df1[df1['Gender'].isin(['Female'])][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99